---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FireRating
source: html/c6d3187c-21d9-d8f8-283b-22f275c4c251.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FireRating Property

"Fire Rating"

## Syntax (C#)
```csharp
public static ForgeTypeId FireRating { get; }
```